In [1]:
### 시리즈의 작성

s = pd.Series([990, 344, 289, 246], index=["서울", "부산", "인천", "대구"])
s

서울    990
부산    344
인천    289
대구    246
dtype: int64

In [2]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [3]:
s.values

array([990, 344, 289, 246])

In [4]:
s.name = "인구"
s.index.name = "도시"
s

도시
서울    990
부산    344
인천    289
대구    246
Name: 인구, dtype: int64

In [5]:
### 인덱싱

In [6]:
s[1]

344

In [7]:
s[[1]]

도시
부산    344
Name: 인구, dtype: int64

In [8]:
s[[0, 3, 1]]

도시
서울    990
대구    246
부산    344
Name: 인구, dtype: int64

In [9]:
s[(250 < s) & (s < 500)]

도시
부산    344
인천    289
Name: 인구, dtype: int64

In [10]:
s[1:3]

도시
부산    344
인천    289
Name: 인구, dtype: int64

In [11]:
s.부산

344

In [12]:
### 시리즈와 딕셔너리 자료형

In [13]:
for k, v in s.items():
    print("%s = %d" % (k,v))

서울 = 990
부산 = 344
인천 = 289
대구 = 246

In [14]:
s

도시
서울    990
부산    344
인천    289
대구    246
Name: 인구, dtype: int64

In [15]:
s2 = pd.Series({"서울" : 963, "부산" : 339, "인천" : 263, "대전" : 149})

In [16]:
ds = s - s2
ds

대구     NaN
대전     NaN
부산     5.0
서울    27.0
인천    26.0
dtype: float64

In [17]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [18]:
ds[ds.notnull()]

부산     5.0
서울    27.0
인천    26.0
dtype: float64

In [19]:
### 연습문제 1 - 시리즈 객체 두개 만들기 + 사칙연산 하기
a1 = pd.Series([10, 20, 30, 40], index=["a", "b", "c", "d"])
a2 = pd.Series({"a":10, "b": 20, "c": 30, "e":50})
print(a1)
print(a2)

a    10
b    20
c    30
d    40
dtype: int64
a    10
b    20
c    30
e    50
dtype: int64

In [20]:
a1 + a2

a    20.0
b    40.0
c    60.0
d     NaN
e     NaN
dtype: float64

In [21]:
a1 - a2

a    0.0
b    0.0
c    0.0
d    NaN
e    NaN
dtype: float64

In [22]:
a1 * a2

a    100.0
b    400.0
c    900.0
d      NaN
e      NaN
dtype: float64

In [23]:
a1 / a2

a    1.0
b    1.0
c    1.0
d    NaN
e    NaN
dtype: float64

In [24]:
### 데이터프레임 만들기

data = {
    "2015" : [990, 344, 289, 246],
    "2010" : [963, 339, 263, 243],
    "2005" : [976, 351, 251, 245],
    "2000" : [985, 365, 246, 247],
    "지역" : ["수도권", "경상권", "수도권", "경상권"]
}

columns = ["지역", "2000", "2005", "2010", "2015"]
index = ["서울", "부산", "인천", "대구"]

df = pd.DataFrame(data, index=index, columns=columns)
df

     지역  2000  2005  2010  2015
서울  수도권   985   976   963   990
부산  경상권   365   351   339   344
인천  수도권   246   251   263   289
대구  경상권   247   245   243   246

In [25]:
### 인덱스에 이름 붙이기
df.columns.name = "특성"
df.index.name = "도시"
df

특성   지역  2000  2005  2010  2015
도시
서울  수도권   985   976   963   990
부산  경상권   365   351   339   344
인천  수도권   246   251   263   289
대구  경상권   247   245   243   246

In [26]:
### 연습문제 2

data = {
    "입고량" : [2000, 3000, 2000, 1000, 200],
    "판매량" : [1500, 2500, 1000, 200, 50],
    "판매율" : [0.75, 0.833, 0.5, 0.2, 0.25],
    "매출액" : [10000, 21000, 5000, 1200, 300],
    "품목" : ["슈트", "바지", "아우터", "이너", "ACC"]
}
columns = ["품목", "입고량", "판매량", "판매율", "매출액"]
index = ["포멀", "캐주얼", "캐주얼", "캐주얼", "기타"]
df2 = pd.DataFrame(data, index=index, columns=columns)
df2

      품목   입고량   판매량    판매율    매출액
포멀    슈트  2000  1500  0.750  10000
캐주얼   바지  3000  2500  0.833  21000
캐주얼  아우터  2000  1000  0.500   5000
캐주얼   이너  1000   200  0.200   1200
기타   ACC   200    50  0.250    300

In [27]:
df2.shape

(5, 5)

In [28]:
df2.T

        포멀    캐주얼   캐주얼   캐주얼    기타
품목      슈트     바지   아우터    이너   ACC
입고량   2000   3000  2000  1000   200
판매량   1500   2500  1000   200    50
판매율   0.75  0.833   0.5   0.2  0.25
매출액  10000  21000  5000  1200   300

In [29]:
df2["입고량"]

포멀     2000
캐주얼    3000
캐주얼    2000
캐주얼    1000
기타      200
Name: 입고량, dtype: int64

In [30]:
df2[["품목", "입고량"]]

      품목   입고량
포멀    슈트  2000
캐주얼   바지  3000
캐주얼  아우터  2000
캐주얼   이너  1000
기타   ACC   200

In [31]:
df2["품목"]["포멀"]

'슈트'

In [32]:
df2[:"포멀"]

    품목   입고량   판매량   판매율    매출액
포멀  슈트  2000  1500  0.75  10000

In [33]:
### 연습문제3
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df3 = pd.DataFrame(data, index=index, columns=columns)

In [34]:
### 1. 수학점수 시리즈로 나타내기

df3["수학"]

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [35]:
### 2. 국어, 영어점수 데이터프래임으로 나타내기
df3[["국어", "영어"]]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [36]:
### 각과목 평균 점수를 새로운 열로 추가
df3["평균"] = ((df3["국어"]+df3["영어"]+df3["수학"])/3).round(2)
df3

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [37]:
### 방자 영어점수 80으로 수정, 평균 재계산
df3["영어"]["방자"]=80
df3["평균"] = ((df3["국어"]+df3["영어"]+df3["수학"])/3).round(2)
df3

/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [42]:
### 춘향의 점수 데이터프레임으로
df3["춘향":"춘향"]

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [43]:
df3["향단":"향단"]

    국어  영어  수학    평균
향단  70  60  80  70.0